import { HtmlContentRenderer } from "@/frontend/website/components/html-content-renderer";

export default function BibleRootPage() {
  return (
    <HtmlContentRenderer
      key={2}
      content={`<p>Հարգելի՛ ընթերցող, Աստվածաշնչյան համարների մեկնությունները կցված են միայն Էջմիածին թարգմանությանը։<br>
&nbsp;&nbsp;&nbsp;<br>
Տեղադրված են <strong>Ծննդոց, Ելից, Թվոց </strong> գրքերի<strong>, Եսայու, Երեմիայի, Դանիէլի, Եզեկիելի</strong> և<strong> <b>տասներկու </b><b>Փոքր Մարգարեների</b></strong> մարգարեական գրքերի և <strong>Մատթեոսի Ավետարանի</strong> մեկնությունները։<br>
Մասամբ տեղադրված են <strong>Երկրորդումն Օրինաց</strong> գրքի (գլուխ 1-10 ),<strong>Մարկոսի, Ղուկասի և Հովհաննեսի ավետարանների</strong> մեկնությունները։<br>
&nbsp;&nbsp;&nbsp;<br>
<strong>Ներսես Շնորհալու, Հովհաննես Ծործորեցու, Գրիգոր Տաթևացու, Ստեփանոս Սյունեցու, Հովհան Ոսկեբերանի, Եփրեմ Ասորու</strong> մեկնություններին զուգահեռ տեղադրված է նաև ռուս աստվածաբան Ալեքսանդր Պավլովիչ Լոպուխինի (1852–1904թ.) հրատարակած Բացատրական Աստվածաշունչ (1904֊1913թ.)՝ գիտահանրամատչելի ժողովածուի մեկնությունները։<br>
&nbsp;&nbsp;&nbsp;<br>
Հին Ուխտում մեկնությանը զուգընթաց ներկայացված է Սուրբ Գրքի մի քանի թարգմանություններ։ Եբրայերեն բնագիրը ներկայացված է Սինոդական (Синодальный) կամ ռուսական և Արարատ թարգմանություններով, իսկ հունարենը (Յոթանասնիցը) ներկայացված է Էջմիածին և գրաբար թարգմանություններով։ Ընդ որում՝ Ա. Պ. Լոպուխինի մեկնություններում հանդիպող սլավոնական կամ եկեղեցա-սլավոնական (церковно-славяннский) թարգմանությունը հիմնականում համընկնում է Էջմիածին թարգմանության, մասամբ էլ՝ Արարատ թարգմանության հետ։<br>
&nbsp;&nbsp;&nbsp;<br>
Այսուհետ կայքի վերջին թարմացումների մասին, կարող եք տեղեկանալ <a href="https://www.facebook.com/shavigh.shavigh?mibextid=ZbWKwL"><span style="color: #993300;">shavigh.am Ֆեյսբուքյան</span></a> էջից։ Աշխատանքները շարունակվում են։ Հայցում ենք ձեր համբերատարությունը։</p>`}
    />
  );
}
