import { GetArticleListItemModel } from "@/http-api/interfaces/site-pages.models";

export const articlesMock: GetArticleListItemModel[] = [
  {
    id: 1,
    title: "Ա. Լոպուխին",
    description:
      "Տերն ասաց Հակոբին. «Վերադարձի՛ր քո հայրերի երկիրը, քո հայրենիքը, և  ես կը լինեմ քեզ հետ»։",
    url: "/",
    createdAt: "2023-10-01T00:00:00Z",
    updatedAt: "2023-10-01T00:00:00Z",
  },
  {
    id: 2,
    title: "Բ. Մարկոս",
    description:
      "Երբ Տերը տեսավ նրանց հավատը, ասաց կաթվածահարին. «Իմ որդի՛, քո մեղքերը քեզ ներում են»։",
    url: "/",
    createdAt: "2023-10-02T00:00:00Z",
    updatedAt: "2023-10-02T00:00:00Z",
  },
  {
    id: 3,
    title: "ՍԱՄՓՍՈՆԸ ԵՒ ԹԱՄՆԱԹԱՑԻ ԱՂՋԻԿԸ",
    description:
      "Սամփսոնն իջաւ Թամնաթա եւ Թամնաթայում այլազգիների աղջիկների մէջ մի կին տեսաւ, որը հաճելի թուաց նրան",
    url: "/",
    createdAt: "2023-10-03T00:00:00Z",
    updatedAt: "2023-10-03T00:00:00Z",
  },
  {
    id: 4,
    title: "ՀՌՈՒԹՆ ԱՇԽԱՏՈՒՄ Է ԲՈՈՍԻ ԱՐՏՈՒՄ",
    description:
      "Նոոմինի ամուսինը մի ազգական ունէր, մեծ կարողութեան տէր մի մարդ՝ Ելիմելէքի ազգից: Նրա անունը Բոոս էր: Նա այրի Նոոմինին տուն տուեց, որ բնակուի նրա մէջ:",
    url: "/",
    createdAt: "2023-10-04T00:00:00Z",
    updatedAt: "2023-10-04T00:00:00Z",
  },
  {
    id: 5,
    title: "ՅԵՐՈԲՈՎԱՄԻ ՈՐԴՈՒ ՄԱՀԸ",
    description:
      "Այն ժամանակ հիւանդացաւ Յերոբովամի որդի Աբիան, 2. եւ Յերոբովամն ասաց իր կնոջը. «Վե՛ր կաց, կերպարանափոխուի՛ր, որ չիմանան, թէ դու Յերոբովամի կինն ես, եւ գնա՛ Սելով: Այնտեղ է ապրում Աքիա մարգարէն: Նա գուշակել է, թէ ես պիտի թագաւորեմ այս ժողովրդի վրայ:",
    url: "/",
    createdAt: "2023-10-05T00:00:00Z",
    updatedAt: "2023-10-05T00:00:00Z",
  },
  {
    id: 6,
    title: "ԵՐԿՈՒ ՆԵՐՔԻՆԻՆԵՐԻ ԴԱՒԱԴՐՈՒԹԻՒՆԸ",
    description:
      "Մուրթքէն մնաց ապարանքում թագաւորի երկու ներքինիների՝ թագաւորի պալատի պահապաններ Դաբիթի ու Թառայի հետ միասին",
    url: "/",
    createdAt: "2023-10-06T00:00:00Z",
    updatedAt: "2023-10-06T00:00:00Z",
  },
  {
    id: 7,
    title: "ՅԻՍՈՒՍ ՊԻՂԱՏՈՍԻ ԱՌԱՋ",
    description:
      " Եւ իսկոյն, վաղ առաւօտեան, ծերերի եւ օրէնսգէտների հետ միասին, քահանայապետները եւ ամբողջ ատեանը խորհուրդ անելով՝ կապեցին Յիսուսին եւ տարան յանձնեցին Պիղատոսին:",
    url: "/",
    createdAt: "2023-10-07T00:00:00Z",
    updatedAt: "2023-10-07T00:00:00Z",
  },
  {
    id: 8,
    title: "ԹԱՓՈՒՐ ԳԵՐԵԶՄԱՆԸ ԵՒ ՅԻՍՈՒՍԻ ՅԱՐՈՒԹԻՒՆԸ",
    description:
      " Եւ երբ շաբաթն անցաւ, Մարիամ Մագդաղենացին, Յակոբոսի մայր Մարիամը եւ Սաղոմէն գնացին խնկի պատրաստութիւն տեսան, որպէսզի գան եւ օծեն նրա մարմինը",
    url: "/",
    createdAt: "2023-10-08T00:00:00Z",
    updatedAt: "2023-10-08T00:00:00Z",
  },
];
